import random
import re

from imports import *
from datetime_utils import *

def is_2_sloga_zhenskiy_rod(word: str) -> bool:
    word = word.lower()

    if not re.fullmatch(r"[а-яё]+", word):
        return False

    if not word.endswith(("а", "я")):
        return False

    if sum(1 for ch in word.lower() if ch in "аеёиоуыэюя") != 2:
        return False

    return True

async def fizhma(update: Update, context):
    # if random.random() > 0.05:
    #     return
    message = update.message
    print(message.text)
    try:
        if not message or not message.text:
            return
        text = message.text
        words_ = re.findall(r"\b[А-Яа-яЁё]+\b", text, flags=re.IGNORECASE)
        words = [word.lower() for word in words_]

        fiiiiiiiiiiiiizhma = next((word for word in words if word.lower() == "фижма"), None)
        fimoz = next((word for word in words if word.lower() == "фимоз"), None)
        totya_pytya = next((word for word in words if word.lower() == "тотя" or word.lower() == "пытя"), None)
        goyda = next((word for word in words if word.lower() == "гойда"), None)

        if fiiiiiiiiiiiiizhma:
            word = fiiiiiiiiiiiiizhma.upper()
            answer = f"КАКАЯ ЕЩЁ {word}????? ХВАТИТ ВЫДУМЫВАТЬ!"
        elif fimoz:
            answer = "…"
        elif totya_pytya:
            answer = "андыр былдыр андеркелбулдылдыр андыр былдыр андеркелбулдылдыр андыр былдыр андеркелбулдылдыр андыр былдыр андыр былдыр андеркелбулдылдыр андыр былдыр андеркелбулдылдыр андыр былдыр андеркелбулдылдыр".upper()
        elif goyda:
            answer = """‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️‼️‼️ГОЙДА‼️‼️ через 15 МИНУТ🇷🇺🇷🇺 будет объявлена ВСЕРОССИЙСКАЯ ГОЙДА ‼️‼️ ПРЕГОТОВЬТЕСЬ всей СТРАНОЙ🇷🇺🇷🇺 и ДАЙТЕ ГОЙДУ‼️‼️ у вас есть 15 МИНУТ на ‼️‼️ОБЩУЮ ГОЙДУ‼️‼️ нГОЙДА ГОЙДА ГОЙДА
ГОЙДА ГОЙДА ГОЙДА
ГОЙДА
ГОЙДА
ГОЙДА
ГОЙДА
ГОЙДА
ГОЙДА
ГОЙДА
ГОЙДА

ГОЙДА ГОЙДА ГОЙДА
ГОЙДА ГОЙДА ГОЙДА
ГОЙДА                ГОЙДА
ГОЙДА                ГОЙДА
ГОЙДА                ГОЙДА
ГОЙДА                ГОЙДА
ГОЙДА ГОЙДА ГОЙДА
ГОЙДА ГОЙДА ГОЙДА

               ГОЙДА

ГОЙДА                ГОЙДА
ГОЙДА                ГОЙДА
ГОЙДА               ГОЙДА! 
ГОЙДА              ГОЙДА!! 
ГОЙДА            ГОЙДА!!!! 
ГОЙДА          ГОЙДА!!!!!! 
ГОЙДА ГОЙДА ГОЙДА
ГОЙДА ГОЙДА ГОЙДА

   ГОЙДА ГОЙДА ГОЙДА
   ГОЙДА ГОЙДА ГОЙДА
   ГОЙДА                ГОЙДА
   ГОЙДА                ГОЙДА
   ГОЙДА                ГОЙДА
   ГОЙДА                ГОЙДА
   ГОЙДА                ГОЙДА
ГОЙДА!!! ГОЙДА!!! ГОЙДА!!!
ГОЙДА!!! ГОЙДА!!! ГОЙДА!!! 
ГОЙДА                          ГОЙДА
ГОЙДА                          ГОЙДА

     ГОЙДА ГОЙДА ГОЙДА
    ГОЙДА ГОЙДА!!ГОЙДА
   ГОЙДА                  ГОЙДА
  ГОЙДА                   ГОЙДА
ГОЙДА!! ГОЙДА!! ГОЙДА
ГОЙДА!! ГОЙДА!!! ГОЙДА
ГОЙДА                      ГОЙДА
ГОЙДА                      ГОЙДА
ГОЙДА                      ГОЙДА ⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
                                ⬜️⬜️⬜️
                            ⬜️⬜️⬜️
                        🟦🟦🟦
                    🟦🟦🟦
               🟦🟦🟦
           🟦🟦🟦
     🟥🟥🟥
🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥

          ⬜️⬜️⬜️⬜️⬜️⬜️⬜️
     ⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️      
⬜️⬜️⬜️                        ⬜️⬜️⬜️
⬜️⬜️                                   ⬜️⬜️
🟦🟦                                   🟦🟦
🟦🟦                                   🟦🟦
🟦🟦                                   🟦🟦
🟦🟦                                   🟦🟦
🟥🟥                                   🟥🟥
🟥🟥🟥                         🟥🟥🟥
    🟥🟥🟥🟥🟥🟥🟥🟥🟥
         🟥🟥🟥🟥🟥🟥

⬜️⬜️                          ⬜️⬜️
  ⬜️⬜️                       ⬜️⬜️
   ⬜️⬜️                    ⬜️⬜️
    ⬜️⬜️                   ⬜️⬜️
     🟦🟦                🟦🟦
       🟦🟦            🟦🟦
        🟦🟦           🟦🟦
         🟦🟦        🟦🟦
          🟥🟥     🟥🟥
            🟥🟥 🟥🟥
               🟥🟥🟥
                  🟥🟥"""
        else:
            words = [
                word for word in words
                if is_2_sloga_zhenskiy_rod(word) and word.lower() not in {
                    "папа",
                    "дядя",
                    "мама"
                }
            ]

            if not words:
                return
            word = random.choice(words).upper()
            answer = f"КАКАЯ ЕЩЁ {word}?????"
            if random.random() < 0.3:
                answer += " ХВАТИТ ВЫДУМЫВАТЬ!"

        await message.reply_text(answer)
    except Exception as e:
        print(f"Error in fizhma: {e}")